In [2]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [3]:
df["Category"] = ["A","B","C","A","B"]
df

      Name  Age Category
0    Alice   25        A
1      Bob   30        B
2  Charlie   35        C
3    David   40        A
4      Eve   45        B

In [4]:
# Categoryカラムに対して、各グループの平均と合計を計算したい
df.groupby("Category")["Age"].mean()

Category
A    32.5
B    37.5
C    35.0
Name: Age, dtype: float64

In [5]:
df.groupby("Category")["Age"].sum()

Category
A    65
B    75
C    35
Name: Age, dtype: int64